#include <iostream>
using namespace std;
//1. Вывести на экран Первую букву имени из символов "*" (звездочка)
int main ()
{
	cout <<"   ***   "<<endl;
	cout <<"  *   *  "<<endl;
	cout <<"  *   *  "<<endl;
	cout <<"*********"<<endl;
	cout <<"*       *"<<endl;
	cout <<"*       *"<<endl;
	
	return (0);
}
