#include <iostream>
//3. Пользователь вводит два числа. Найдите разность и частное данных чисе
using namespace std;
int main (){
	float a, b, c, d; //float переменные с остатком
	cout <<"Imput a and s"<<endl; //вывести текст
	cin >>a>>b;
	c = a-b;
	d = a/b;
	cout <<"c="<<c<<endl <<"d="<<d<<endl; //выводим результат
	return (0);
	
	
}