/*7. Пользователь вводит число. Выведите на экран квадрат этого числа, куб этого 
числа.*/
#include <iostream>
using namespace std;
int main (){
	int a, A, B;
	cout<<"Imput a"<<endl;
	cin>>a;
	cout<<a*a<<endl <<a*a*a<<endl;
	return (0);
}